Revit 2025 API
DGNFileFormat Enumeration
 An enumerated type listing available Microstation versions into which a file may be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DGNFileFormat
Public Enumeration DGNFileFormat
public enum class DGNFileFormat
type DGNFileFormat
Members
Member name | Value | Description
DGNVersion7 | 19 |  Micorstation V7 file format.
Default | 20 |  The Autodesk Revit application's default file format.
DGNVersion8 | 20 |  Micorstation V8 file format.
See Also
Reference
Autodesk.Revit.DB Namespace